In [1]:
import pandas as pd
from bs4 import BeautifulSoup 
import requests
import datetime
from datetime import date 
import time
import json
import csv
import numpy as np
import re
import lxml.html
import os
import tabula

In [2]:
!java -version

java version "21" 2023-09-19 LTS
Java(TM) SE Runtime Environment (build 21+35-LTS-2513)
Java HotSpot(TM) 64-Bit Server VM (build 21+35-LTS-2513, mixed mode, sharing)

In [3]:
tabula.environment_info()

Python version:
    3.10.11 (main, Jul 24 2023, 14:37:32) [Clang 15.0.0 (clang-1500.0.34.3)]
Java version:
    java version "21" 2023-09-19 LTS
Java(TM) SE Runtime Environment (build 21+35-LTS-2513)
Java HotSpot(TM) 64-Bit Server VM (build 21+35-LTS-2513, mixed mode, sharing)
tabula-py version: 2.8.2
platform: macOS-13.5-arm64-arm-64bit
uname:
    uname_result(system='Darwin', node='Marie-Frances-2021-MacBook-Pro.local', release='22.6.0', version='Darwin Kernel Version 22.6.0: Wed Jul  5 22:22:05 PDT 2023; root:xnu-8796.141.3~6/RELEASE_ARM64_T6000', machine='arm64')
linux_distribution: ('Darwin', '22.6.0', '')
mac_ver: ('13.5', ('', '', ''), 'arm64')

In [4]:
wta_path = "https://wtafiles.wtatennis.com/pdf/rankings/All_YTD_Prize_Money.pdf"

In [12]:
atp_path = "https://www.protennislive.com/posting/ramr/current_prize.pdf"

In [6]:
wta_dfs = tabula.read_pdf(wta_path, stream=True)
# read_pdf returns list of DataFrames
print(len(wta_dfs))

'pages' argument isn't specified.Will extract only from page 1 by default.

1

In [8]:
len(wta_dfs)

1

In [7]:
print(wta_dfs[0])

    Standing                    Name  Nat    Singles  Doubles   Mixed  \
0          1        SABALENKA, ARYNA  NaN  7,362,685    6,950     NaN
1          2             GAUFF, COCO  USA  4,903,882  653,490     NaN
2          3            SWIATEK, IGA  POL  5,455,686      NaN     NaN
3          4         RYBAKINA, ELENA  KAZ  4,631,334   64,103     NaN
4          5    VONDROUSOVA, MARKETA  CZE  4,104,203  138,750     NaN
5          6         PEGULA, JESSICA  USA  3,471,367  653,490  52,054
6          7       MUCHOVA, KAROLINA  CZE  2,796,338    8,100     NaN
7          8             JABEUR, ONS  TUN  2,706,604   18,885     NaN
8          9          KVITOVA, PETRA  CZE  2,436,381      NaN     NaN
9         10           KEYS, MADISON  USA  2,339,898   16,560     NaN
10        11          SAKKARI, MARIA  GRE  2,205,621    5,274     NaN
11        12    HADDAD MAIA, BEATRIZ  BRA  1,659,666  332,156     NaN
12        13     KREJCIKOVA, BARBORA  CZE  1,444,599  529,494     NaN
13        14       OSTAPENKO, JELENA  LAT  1,602,108  197,006  22,424
14        15      AZARENKA, VICTORIA  NaN  1,435,758  279,509     NaN
15        16          MERTENS, ELISE  BEL  1,117,130  543,358     NaN
16        17          LINETTE, MAGDA  POL  1,438,007  195,746     NaN
17        18         BENCIC, BELINDA  SUI  1,551,101   50,827     NaN
18        19        GARCIA, CAROLINE  FRA  1,437,515   78,062     NaN
19        20         CIRSTEA, SORANA  ROU  1,459,955      NaN     NaN
20        21        SVITOLINA, ELINA  UKR  1,457,493      NaN     NaN
21        22  ALEXANDROVA, EKATERINA  NaN  1,269,365   99,951     NaN
22        23        KASATKINA, DARIA  NaN  1,333,062   33,305     NaN
23        24   KUDERMETOVA, VERONIKA  NaN  1,155,918  192,213     NaN
24        25     SAMSONOVA, LIUDMILA  NaN  1,138,793  175,543   7,750
25        26             WANG, XINYU  CHN    823,102  416,187     NaN
26        27            VEKIC, DONNA  CRO  1,179,564   59,337     NaN
27        28         BOUZKOVA, MARIE  CZE  1,000,852  200,947     NaN
28        29           ZHENG, QINWEN  CHN  1,151,037      NaN     NaN
29        30       TREVISAN, MARTINA  ITA  1,070,456   64,733     NaN
30        31      PLISKOVA, KAROLINA  CZE  1,013,744   47,885     NaN
31        32     POTAPOVA, ANASTASIA  NaN    987,033   73,734     NaN
32        33          PERA, BERNARDA  USA    891,525  156,921   7,750
33        34     SINIAKOVA, KATERINA  CZE    487,186  550,245     NaN
34        35      KALININA, ANHELINA  UKR    945,293   89,186     NaN
35        36        TOWNSEND, TAYLOR  USA    544,683  429,223  56,424
36        37       FERNANDEZ, LEYLAH  CAN    684,958  334,280   7,750
37        38          KOSTYUK, MARTA  UKR    746,753  231,216  34,000
38        39           HUNTER, STORM  AUS    397,601  566,933  18,554
39        40           MARTIC, PETRA  CRO    951,876   21,260     NaN
40        41         TSURENKO, LESIA  UKR    879,197      NaN     NaN
41        42           HSIEH, SU-WEI  TPE     52,370  805,364  17,100
42        43       COLLINS, DANIELLE  USA    751,601  104,828     NaN
43        44                ZHU, LIN  CHN    765,051   77,436     NaN
44        45     BEGU, IRINA-CAMELIA  ROU    753,906   81,501     NaN
45        46            KENIN, SOFIA  USA    766,167   48,652     NaN

        Total
0   7,369,635
1   5,557,372
2   5,455,686
3   4,695,437
4   4,242,953
5   4,176,912
6   2,804,438
7   2,725,489
8   2,436,381
9   2,356,458
10  2,210,895
11  1,991,822
12  1,974,093
13  1,821,538
14  1,715,267
15  1,660,488
16  1,633,753
17  1,601,928
18  1,515,577
19  1,459,955
20  1,457,493
21  1,369,316
22  1,366,367
23  1,348,131
24  1,322,086
25  1,239,289
26  1,238,901
27  1,201,799
28  1,151,037
29  1,135,189
30  1,061,629
31  1,060,767
32  1,056,196
33  1,037,431
34  1,034,479
35  1,030,330
36  1,026,988
37  1,011,969
38    983,088
39    973,136
40    879,197
41    874,834
42    856,429
43    842,487
44    835,407
45    814,819

In [ ]:
#why is there a newline after "mixed"?? How to correct?

In [14]:
atp_dfs = tabula.read_pdf(atp_path, stream=False)
# read_pdf returns list of DataFrames

HTTPError: HTTP Error 403: Forbidden

In [11]:
help(tabula.read_pdf)

Help on function read_pdf in module tabula.io:

read_pdf(input_path: Union[IO, str, os.PathLike], output_format: Optional[str] = None, encoding: str = 'utf-8', java_options: Optional[List[str]] = None, pandas_options: Optional[Dict[str, Any]] = None, multiple_tables: bool = True, user_agent: Optional[str] = None, use_raw_url: bool = False, pages: Union[str, int, Iterable[int], NoneType] = None, guess: bool = True, area: Union[Iterable[float], Iterable[Iterable[float]], NoneType] = None, relative_area: bool = False, lattice: bool = False, stream: bool = False, password: Optional[str] = None, silent: Optional[bool] = None, columns: Optional[Iterable[float]] = None, relative_columns: bool = False, format: Optional[str] = None, batch: Optional[str] = None, output_path: Optional[str] = None, force_subprocess: bool = False, options: str = '') -> Union[List[pandas.core.frame.DataFrame], Dict[str, Any]]
    Read tables in PDF.

    Args:
        input_path (str, path object or file-like object):
            File like object of target PDF file.
            It can be URL, which is downloaded by tabula-py automatically.
        output_format (str, optional):
            Output format for returned object (``dataframe`` or ``json``)
            Giving this option enforces to ignore `multiple_tables` option.
        encoding (str, optional):
            Encoding type for pandas. Default: ``utf-8``
        java_options (list, optional):
            Set java options. This option will be ignored once JVM is launched.

            Example:
                ``["-Xmx256m"]``
        pandas_options (dict, optional):
            Set pandas options.

            Example:
                ``{'header': None}``

            Note:
                With ``multiple_tables=True`` (default), pandas_options is passed
                to pandas.DataFrame, otherwise it is passed to pandas.read_csv.
                Those two functions are different for accept options like ``dtype``.
        multiple_tables (bool):
            It enables to handle multiple tables within a page. Default: ``True``

            Note:
                If `multiple_tables` option is enabled, tabula-py uses not
                :func:`pd.read_csv()`, but :func:`pd.DataFrame()`. Make
                sure to pass appropriate `pandas_options`.
        user_agent (str, optional):
            Set a custom user-agent when download a pdf from a url. Otherwise
            it uses the default ``urllib.request`` user-agent.
        use_raw_url (bool):
            It enforces to use `input_path` string for url without quoting/dequoting.
            Default: False
        pages (str, int, `iterable` of `int`, optional):
            An optional values specifying pages to extract from. It allows
            `str`,`int`, `iterable` of :`int`. Default: `1`

            Examples:
                ``'1-2,3'``, ``'all'``, ``[1,2]``
        guess (bool, optional):
            Guess the portion of the page to analyze per page. Default `True`
            If you use "area" option, this option becomes `False`.

            Note:
                As of tabula-java 1.0.3, guess option becomes independent from
                lattice and stream option, you can use guess and lattice/stream option
                at the same time.

        area (iterable of float, iterable of iterable of float, optional):
            Portion of the page to analyze(top,left,bottom,right).
            Default is entire page.

            Note:
                If you want to use multiple area options and extract in one table, it
                should be better to set ``multiple_tables=False`` for :func:`read_pdf()`

            Examples:
                ``[269.875,12.75,790.5,561]``,
                ``[[12.1,20.5,30.1,50.2], [1.0,3.2,10.5,40.2]]``

        relative_area (bool, optional):
            If all area values are between 0-100 (inclusive) and preceded by ``'%'``,
            input will be taken as % of actual height or width of the page.
            Default ``False``.
        lattice (bool, optional):
            Force PDF to be extracted using lattice-mode extraction
            (if there are ruling lines separating each cell, as in a PDF of an
            Excel spreadsheet)
        stream (bool, optional):
            Force PDF to be extracted using stream-mode extraction
            (if there are no ruling lines separating each cell, as in a PDF of an
            Excel spreadsheet)
        password (str, optional):
            Password to decrypt document. Default: empty
        silent (bool, optional):
            Suppress all stderr output.
        columns (iterable, optional):
            X coordinates of column boundaries.

            Example:
                ``[10.1, 20.2, 30.3]``
        relative_columns (bool, optional):
            If all values are between 0-100 (inclusive) and preceded by '%',
            input will be taken as % of actual width of the page.
            Default ``False``.
        format (str, optional):
            Format for output file or extracted object.
            (``"CSV"``, ``"TSV"``, ``"JSON"``)
        batch (str, optional):
            Convert all PDF files in the provided directory. This argument should be
            directory path.
        output_path (str, optional):
            Output file path. File format of it is depends on ``format``.
            Same as ``--outfile`` option of tabula-java.
        force_subprocess (bool):
            Force to use tabula-java subprocess mode. If you have some issue with
            jpype, try this option with same environment.
            Default ``False``.
        options (str, optional):
            Raw option string for tabula-java.

    Returns:
        list of DataFrames or dict.

    Raises:
        FileNotFoundError:
            If downloaded remote file doesn't exist.

        ValueError:
            If output_format is unknown format, or if downloaded remote file size is 0.

        tabula.errors.CSVParseError:
            If pandas CSV parsing failed.

        tabula.errors.JavaNotFoundError:
            If java is not installed or found.

        subprocess.CalledProcessError:
            If tabula-java execution failed.

    Examples:

        Here is a simple example.
        Note that :func:`read_pdf()` only extract page 1 by default.

        Notes:
            As of tabula-py 2.0.0, :func:`read_pdf()` sets `multiple_tables=True` by
            default. If you want to get consistent output with previous version, set
            `multiple_tables=False`.

        >>> import tabula
        >>> pdf_path = "https://github.com/chezou/tabula-py/raw/master/tests/resources/data.pdf"
        >>> tabula.read_pdf(pdf_path, stream=True)
        [             Unnamed: 0   mpg  cyl   disp   hp  drat     wt   qsec  vs  am  gear  carb
        0             Mazda RX4  21.0    6  160.0  110  3.90  2.620  16.46   0   1     4     4
        1         Mazda RX4 Wag  21.0    6  160.0  110  3.90  2.875  17.02   0   1     4     4
        2            Datsun 710  22.8    4  108.0   93  3.85  2.320  18.61   1   1     4     1
        3        Hornet 4 Drive  21.4    6  258.0  110  3.08  3.215  19.44   1   0     3     1
        4     Hornet Sportabout  18.7    8  360.0  175  3.15  3.440  17.02   0   0     3     2
        5               Valiant  18.1    6  225.0  105  2.76  3.460  20.22   1   0     3     1
        6            Duster 360  14.3    8  360.0  245  3.21  3.570  15.84   0   0     3     4
        7             Merc 240D  24.4    4  146.7   62  3.69  3.190  20.00   1   0     4     2
        8              Merc 230  22.8    4  140.8   95  3.92  3.150  22.90   1   0     4     2
        9              Merc 280  19.2    6  167.6  123  3.92  3.440  18.30   1   0     4     4
        10            Merc 280C  17.8    6  167.6  123  3.92  3.440  18.90   1   0     4     4
        11           Merc 450SE  16.4    8  275.8  180  3.07  4.070  17.40   0   0     3     3
        12           Merc 450SL  17.3    8  275.8  180  3.07  3.730  17.60   0   0     3     3
        13          Merc 450SLC  15.2    8  275.8  180  3.07  3.780  18.00   0   0     3     3
        14   Cadillac Fleetwood  10.4    8  472.0  205  2.93  5.250  17.98   0   0     3     4
        15  Lincoln Continental  10.4    8  460.0  215  3.00  5.424  17.82   0   0     3     4
        16    Chrysler Imperial  14.7    8  440.0  230  3.23  5.345  17.42   0   0     3     4
        17             Fiat 128  32.4    4   78.7   66  4.08  2.200  19.47   1   1     4     1
        18          Honda Civic  30.4    4   75.7   52  4.93  1.615  18.52   1   1     4     2
        19       Toyota Corolla  33.9    4   71.1   65  4.22  1.835  19.90   1   1     4     1
        20        Toyota Corona  21.5    4  120.1   97  3.70  2.465  20.01   1   0     3     1
        21     Dodge Challenger  15.5    8  318.0  150  2.76  3.520  16.87   0   0     3     2
        22          AMC Javelin  15.2    8  304.0  150  3.15  3.435  17.30   0   0     3     2
        23           Camaro Z28  13.3    8  350.0  245  3.73  3.840  15.41   0   0     3     4
        24     Pontiac Firebird  19.2    8  400.0  175  3.08  3.845  17.05   0   0     3     2
        25            Fiat X1-9  27.3    4   79.0   66  4.08  1.935  18.90   1   1     4     1
        26        Porsche 914-2  26.0    4  120.3   91  4.43  2.140  16.70   0   1     5     2
        27         Lotus Europa  30.4    4   95.1  113  3.77  1.513  16.90   1   1     5     2
        28       Ford Pantera L  15.8    8  351.0  264  4.22  3.170  14.50   0   1     5     4
        29         Ferrari Dino  19.7    6  145.0  175  3.62  2.770  15.50   0   1     5     6
        30        Maserati Bora  15.0    8  301.0  335  3.54  3.570  14.60   0   1     5     8
        31           Volvo 142E  21.4    4  121.0  109  4.11  2.780  18.60   1   1     4     2]

        If you want to extract all pages, set ``pages="all"``.

        >>> dfs = tabula.read_pdf(pdf_path, pages="all")
        >>> len(dfs)
        4
        >>> dfs
        [       0    1      2    3     4      5      6   7   8     9
        0    mpg  cyl   disp   hp  drat     wt   qsec  vs  am  gear
        1   21.0    6  160.0  110  3.90  2.620  16.46   0   1     4
        2   21.0    6  160.0  110  3.90  2.875  17.02   0   1     4
        3   22.8    4  108.0   93  3.85  2.320  18.61   1   1     4
        4   21.4    6  258.0  110  3.08  3.215  19.44   1   0     3
        5   18.7    8  360.0  175  3.15  3.440  17.02   0   0     3
        6   18.1    6  225.0  105  2.76  3.460  20.22   1   0     3
        7   14.3    8  360.0  245  3.21  3.570  15.84   0   0     3
        8   24.4    4  146.7   62  3.69  3.190  20.00   1   0     4
        9   22.8    4  140.8   95  3.92  3.150  22.90   1   0     4
        10  19.2    6  167.6  123  3.92  3.440  18.30   1   0     4
        11  17.8    6  167.6  123  3.92  3.440  18.90   1   0     4
        12  16.4    8  275.8  180  3.07  4.070  17.40   0   0     3
        13  17.3    8  275.8  180  3.07  3.730  17.60   0   0     3
        14  15.2    8  275.8  180  3.07  3.780  18.00   0   0     3
        15  10.4    8  472.0  205  2.93  5.250  17.98   0   0     3
        16  10.4    8  460.0  215  3.00  5.424  17.82   0   0     3
        17  14.7    8  440.0  230  3.23  5.345  17.42   0   0     3
        18  32.4    4   78.7   66  4.08  2.200  19.47   1   1     4
        19  30.4    4   75.7   52  4.93  1.615  18.52   1   1     4
        20  33.9    4   71.1   65  4.22  1.835  19.90   1   1     4
        21  21.5    4  120.1   97  3.70  2.465  20.01   1   0     3
        22  15.5    8  318.0  150  2.76  3.520  16.87   0   0     3
        23  15.2    8  304.0  150  3.15  3.435  17.30   0   0     3
        24  13.3    8  350.0  245  3.73  3.840  15.41   0   0     3
        25  19.2    8  400.0  175  3.08  3.845  17.05   0   0     3
        26  27.3    4   79.0   66  4.08  1.935  18.90   1   1     4
        27  26.0    4  120.3   91  4.43  2.140  16.70   0   1     5
        28  30.4    4   95.1  113  3.77  1.513  16.90   1   1     5
        29  15.8    8  351.0  264  4.22  3.170  14.50   0   1     5
        30  19.7    6  145.0  175  3.62  2.770  15.50   0   1     5
        31  15.0    8  301.0  335  3.54  3.570  14.60   0   1     5,               0            1             2            3        4
        0  Sepal.Length  Sepal.Width  Petal.Length  Petal.Width  Species
        1           5.1          3.5           1.4          0.2   setosa
        2           4.9          3.0           1.4          0.2   setosa
        3           4.7          3.2           1.3          0.2   setosa
        4           4.6          3.1           1.5          0.2   setosa
        5           5.0          3.6           1.4          0.2   setosa
        6           5.4          3.9           1.7          0.4   setosa,      0             1            2             3            4          5
        0  NaN  Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
        1  145           6.7          3.3           5.7          2.5  virginica
        2  146           6.7          3.0           5.2          2.3  virginica
        3  147           6.3          2.5           5.0          1.9  virginica
        4  148           6.5          3.0           5.2          2.0  virginica
        5  149           6.2          3.4           5.4          2.3  virginica
        6  150           5.9          3.0           5.1          1.8  virginica,        0
        0   supp
        1     VC
        2     VC
        3     VC
        4     VC
        5     VC
        6     VC
        7     VC
        8     VC
        9     VC
        10    VC
        11    VC
        12    VC
        13    VC
        14    VC]

In [73]:
atp_dfs = tabula.read_pdf(atp_path, stream=True, user_agent="Mozilla/5.0", pages='1-12')

In [74]:
len(atp_dfs)

12

In [22]:
print(atp_dfs[11])

    485           Ejupovic, Elmar  $36,603  $34,356   $2,247    $139,689
0   486              Kadhe, Arjun  $36,554   $4,967  $31,587    $173,211
1   487            Klaasen, Raven  $36,423       $0  $36,423  $4,014,060
2   488       Harrison, Christian  $36,187  $14,983  $21,204    $660,795
3   489   Prashanth, Vijay Sundar  $35,980       $0  $35,980    $168,292
4   490         Oberleitner, Neil  $35,746  $19,072  $16,674     $78,063
5   491                 Borg, Leo  $35,723  $32,659   $3,064     $80,445
6   492     Moro Canas, Alejandro  $35,585  $34,291   $1,294     $87,730
7   493           Sinclair, Colin  $35,261  $22,468  $12,793     $98,137
8   494          Wendelken, Harry  $34,885  $31,688   $3,197     $60,341
9   495            Sugita, Yuichi  $34,810  $34,810       $0  $3,013,099
10  496              Chung, Hyeon  $34,186  $34,186       $0  $3,734,399
11  497                 Zhu, Evan  $34,104  $29,460   $4,644    $122,276
12  498     Boscardin Dias, Pedro  $34,003  $20,893  $13,110     $71,742
13  499               Cox, Daniel  $33,988  $33,988       $0    $327,313
14  500        Manafov, Vladyslav  $33,370     $407  $32,963    $211,348
15  501              Rosol, Lukas  $33,344  $32,422     $922  $4,716,272
16  502             Blanchet, Ugo  $33,265  $29,885   $3,380     $99,062
17  503      Jorda Sanchis, David  $33,165  $28,740   $4,425     $81,848
18  504  Lopez San Martin, Alvaro  $33,072  $27,825   $5,247    $135,926
19  505             Reese, Hunter  $33,026       $0  $33,026    $269,461
20  506            Echargui, Moez  $33,014  $31,319   $1,695    $134,192
21  507     Martos Gornes, Sergio  $32,698       $0  $32,698    $159,934
22  508             Lama, Gonzalo  $32,479  $31,076   $1,403    $291,370
23  509              Luz, Orlando  $32,453  $14,590  $17,863    $248,864
24  510             Gengel, Marek  $32,451  $24,895   $7,556    $165,208
25  511           Weis, Alexander  $32,319  $28,027   $4,292    $114,536
26  512           Poullain, Lucas  $32,316  $31,161   $1,155     $72,853
27  513             Stodder, Timo  $32,065  $28,906   $3,159     $88,639
28  514       Dalla Valle, Enrico  $32,013  $29,881   $2,132    $103,667
29  515         Romboli, Fernando  $31,993     $382  $31,611    $363,704
30  516           Moeller, Marvin  $31,926  $27,350   $4,576     $99,661
31  517      Vandecasteele, Quinn  $31,837  $31,225     $612     $33,893
32  518              Kirkin, Ergi  $31,788  $25,085   $6,703    $132,446
33  519               Houkes, Max  $31,775  $28,748   $3,027     $72,501
34  520     Jianu, Filip Cristian  $31,764  $29,338   $2,426    $126,291
35  521         Rehberg, Max Hans  $31,516  $26,776   $4,740     $75,516
36  522          Marcora, Roberto  $31,465  $30,585     $880    $573,053
37  523            Poljicak, Mili  $31,165  $28,229   $2,936     $62,326
38  524               Kodat, Toby  $31,145  $28,984   $2,161     $77,718
39  525            Winter, Edward  $30,651  $26,786   $3,865     $69,087
40  526          Santillan, Akira  $30,650  $21,703   $8,947    $484,055
41  527        Lazarov, Alexandar  $30,605  $30,605       $0    $182,272
42  528         Vrbensky, Michael  $30,562  $23,967   $6,595    $149,156

In [17]:
print(atp_dfs[1])

IndexError: list index out of range

In [75]:
wta_dfs = tabula.read_pdf(wta_path, stream=True, user_agent="Mozilla/5.0", pages='1-11')
# read_pdf returns list of DataFrames

In [76]:
print(len(wta_dfs))

11

In [25]:
print(wta_dfs[10])

    Standing                            Name  Nat Singles Doubles  Mixed  \
0        461                 LODIKOVA, DARIA  NaN  18,746   3,048    NaN
1        462               BUYUKAKCAY, CAGLA  TUR  19,640   1,907    NaN
2        463                   DUERST, JENNY  SUI  14,306   7,192    NaN
3        464                COSTOULAS, SOFIA  BEL  16,634   4,587    NaN
4        465                      WEI, SIJIA  CHN  18,114   3,093    NaN
5        466          GARCIA PEREZ, GEORGINA  ESP  14,275   6,499    NaN
6        467                IATCENKO, POLINA  NaN  17,887   2,654    NaN
7        468                        ITO, AOI  JPN  16,173   4,317    NaN
8        469                 BHOSALE, RUTUJA  IND  14,470   5,639    NaN
9        470             MARCINKEVICA, DIANA  LAT  13,434   6,510    NaN
10       471                   HAAS, BARBARA  AUT  19,825     101    NaN
11       472                 HEWITT, DALAYNA  USA  11,919   7,428    NaN
12       473               KUZMOVA, KATARINA  SVK  15,755   3,407    NaN
13       474                   BOSKOVIC, LEA  CRO  18,114   1,038    NaN
14       475            SOBOLEVA, ANASTASIYA  UKR  17,858   1,240    NaN
15       476           CIRIC BAGARIC, LUCIJA  CRO  18,077   1,020    NaN
16       477                  JORGE, MATILDE  POR   7,962  11,125    NaN
17       478                  OKAMURA, KYOKA  JPN  15,512   3,489    NaN
18       479           DI LORENZO, FRANCESCA  USA  12,671   6,268    NaN
19       480                    ROGERS, ANNA  USA   5,951  12,868    NaN
20       481               GABUEVA, ANGELINA  NaN   2,804  15,932    NaN
21       482                    SMITH, ALANA  USA  15,269   3,455    NaN
22       483                RYSER, VALENTINA  SUI  17,468   1,251    NaN
23       484                STOSUR, SAMANTHA  AUS     NaN  14,082  4,554
24       485                   RADISIC, NIKA  SLO  10,026   8,567    NaN
25       486                 MALYGINA, ELENA  EST  15,181   3,331    NaN
26       487                KUMKHUM, LUKSIKA  THA   8,991   9,476    NaN
27       488                BOJICA, STEFANIA  ROU  16,262   2,042    NaN
28       489                AMBROSIO, SILVIA  ITA  17,371     916    NaN
29       490               KOZAROV, KATARINA  SRB  16,285   1,987    NaN
30       491                 KURAMOCHI, MIHO  JPN  16,600   1,552    NaN
31       492              CHERUBINI, DILETTA  ITA  15,646   2,445    NaN
32       493                  OSTLUND, FANNY  SWE  11,329   6,653    NaN
33       494   NAVARRO OLIVA, MARIA FERNANDA  MEX  12,554   5,383    NaN
34       495                 MBOKO, VICTORIA  CAN  16,459   1,471    NaN
35       496                      GUTH, MARA  GER  16,320   1,595    NaN
36       497             FOMINA-KLOTZ, ALENA  NaN   1,394  16,435    NaN
37       498             BAYERLOVA, MICHAELA  CZE  11,330   6,450    NaN
38       499          SAWANGKAEW, MANANCHAYA  THA  16,980     795    NaN
39       500                   GAVRILA, OANA  ROU   7,935   9,765    NaN
40       501                   GLUSHKO, LINA  ISR  13,259   4,439    NaN
41       502                    CE, GABRIELA  BRA  17,694     NaN    NaN
42       503                 MATOULA, MARTHA  GRE  15,220   2,459    NaN
43       504          FALCONI HARTMAN, IRINA  USA  17,183     408    NaN
44       505  FERNANDEZ OLIVARES, LYA ISABEL  MEX  17,584     NaN    NaN
45       506                      XU, MINGGE  GBR  17,088     254    NaN

     Total
0   21,794
1   21,548
2   21,498
3   21,222
4   21,208
5   20,775
6   20,542
7   20,490
8   20,109
9   19,944
10  19,926
11  19,347
12  19,163
13  19,152
14  19,098
15  19,097
16  19,087
17  19,002
18  18,939
19  18,819
20  18,736
21  18,724
22  18,719
23  18,636
24  18,594
25  18,512
26  18,467
27  18,304
28  18,287
29  18,272
30  18,152
31  18,091
32  17,982
33  17,938
34  17,930
35  17,915
36  17,830
37  17,780
38  17,776
39  17,701
40  17,698
41  17,694
42  17,679
43  17,591
44  17,584
45  17,342

In [77]:
print(wta_dfs[10].columns)

Index(['Standing', 'Name', 'Nat', 'Singles', 'Doubles', 'Mixed', 'Total'], dtype='object')

In [29]:
#only keep the columns that are common to the two dfs
#wta_dfs = wta_dfs[['Name', , ]
women_df= pd.DataFrame([])

for wta_df in wta_dfs:
    wta_df = wta_df[['Name', 'Total', 'Singles','Doubles' ]]
    women_df = pd.concat([women_df, wta_df])

In [31]:
print(women_df)

                              Name      Total    Singles  Doubles
0                 SABALENKA, ARYNA  7,369,635  7,362,685    6,950
1                      GAUFF, COCO  5,557,372  4,903,882  653,490
2                     SWIATEK, IGA  5,455,686  5,455,686      NaN
3                  RYBAKINA, ELENA  4,695,437  4,631,334   64,103
4             VONDROUSOVA, MARKETA  4,242,953  4,104,203  138,750
..                             ...        ...        ...      ...
41                    CE, GABRIELA     17,694     17,694      NaN
42                 MATOULA, MARTHA     17,679     15,220    2,459
43          FALCONI HARTMAN, IRINA     17,591     17,183      408
44  FERNANDEZ OLIVARES, LYA ISABEL     17,584     17,584      NaN
45                      XU, MINGGE     17,342     17,088      254

[506 rows x 4 columns]

In [32]:
print(women_df.columns)

Index(['Name', 'Total', 'Singles', 'Doubles'], dtype='object')

In [33]:
women_df.reset_index()

     index                            Name      Total    Singles  Doubles
0        0                SABALENKA, ARYNA  7,369,635  7,362,685    6,950
1        1                     GAUFF, COCO  5,557,372  4,903,882  653,490
2        2                    SWIATEK, IGA  5,455,686  5,455,686      NaN
3        3                 RYBAKINA, ELENA  4,695,437  4,631,334   64,103
4        4            VONDROUSOVA, MARKETA  4,242,953  4,104,203  138,750
..     ...                             ...        ...        ...      ...
501     41                    CE, GABRIELA     17,694     17,694      NaN
502     42                 MATOULA, MARTHA     17,679     15,220    2,459
503     43          FALCONI HARTMAN, IRINA     17,591     17,183      408
504     44  FERNANDEZ OLIVARES, LYA ISABEL     17,584     17,584      NaN
505     45                      XU, MINGGE     17,342     17,088      254

[506 rows x 5 columns]

In [38]:
atp_dfs = tabula.read_pdf(atp_path, stream=True, user_agent="Mozilla/5.0", pages='1-12', pandas_options={'header': None})

In [39]:
print(atp_dfs[0].columns)

RangeIndex(start=0, stop=6, step=1)

In [40]:
print(atp_dfs[0])

     0                             1            2            3           4  \
0    1               Djokovic, Novak  $10,590,175  $10,581,665      $8,510
1    2               Alcaraz, Carlos   $9,506,924   $9,506,924          $0
2    3              Medvedev, Daniil   $7,777,474   $7,777,474          $0
3    4                Sinner, Jannik   $5,092,373   $5,041,360     $51,013
4    5                Rublev, Andrey   $4,052,486   $3,714,248    $338,238
5    6           Tsitsipas, Stefanos   $4,051,088   $3,948,858    $102,230
6    7             Zverev, Alexander   $3,614,697   $3,517,696     $97,001
7    8                 Fritz, Taylor   $3,306,078   $3,219,440     $86,638
8    9                  Rune, Holger   $3,126,784   $3,104,273     $22,511
9   10                  Ruud, Casper   $2,945,335   $2,919,253     $26,082
10  11               de Minaur, Alex   $2,645,421   $2,580,717     $64,704
11  12               Tiafoe, Frances   $2,515,811   $2,448,285     $67,526
12  13              Khachanov, Karen   $2,420,612   $2,133,602    $287,010
13  14                   Paul, Tommy   $2,363,425   $2,303,982     $59,443
14  15               Hurkacz, Hubert   $2,077,551   $1,988,312     $89,239
15  16               Norrie, Cameron   $2,031,569   $2,006,517     $25,052
16  17                  Shelton, Ben   $1,928,095   $1,747,224    $180,871
17  18              Musetti, Lorenzo   $1,877,889   $1,832,510     $45,379
18  19              Dimitrov, Grigor   $1,836,801   $1,798,253     $38,548
19  20  Davidovich Fokina, Alejandro   $1,774,947   $1,735,894     $39,053
20  21          Cerundolo, Francisco   $1,746,986   $1,687,443     $59,543
21  22                 Lehecka, Jiri   $1,581,297   $1,502,900     $78,397
22  23             Mannarino, Adrian   $1,529,642   $1,462,770     $66,872
23  24                 Evans, Daniel   $1,526,188   $1,436,171     $90,017
24  25                Jarry, Nicolas   $1,489,250   $1,454,924     $34,326
25  26            Griekspoor, Tallon   $1,427,188   $1,302,494    $124,694
26  27             Bublik, Alexander   $1,425,108   $1,351,990     $73,118
27  28                  Coric, Borna   $1,423,273   $1,418,121      $5,152
28  29      Etcheverry, Tomas Martin   $1,380,354   $1,285,814     $94,540
29  30          Eubanks, Christopher   $1,349,298   $1,278,850     $70,448
30  31           McDonald, Mackenzie   $1,318,078   $1,142,959    $175,119
31  32           Struff, Jan-Lennard   $1,247,642   $1,209,892     $37,750
32  33                  Djere, Laslo   $1,213,643   $1,186,516     $27,127
33  34               Baez, Sebastian   $1,204,693   $1,120,085     $84,608
34  35               Sonego, Lorenzo   $1,189,502   $1,149,768     $39,734
35  36           Nishioka, Yoshihito   $1,172,857   $1,134,776     $38,081
36  37              Korda, Sebastian   $1,163,885   $1,150,645     $13,240
37  38        Auger-Aliassime, Felix   $1,146,234   $1,077,063     $69,171
38  39                Wawrinka, Stan   $1,143,656   $1,101,407     $42,249
39  40      van de Zandschulp, Botic   $1,126,802     $927,197    $199,605
40  41                 Kubler, Jason   $1,095,448     $745,575    $349,873
41  42              Krajicek, Austin   $1,088,688           $0  $1,088,688
42  43               Karatsev, Aslan   $1,060,302   $1,027,666     $32,636
43  44              Safiullin, Roman   $1,036,486   $1,012,746     $23,740

               5
0   $175,281,484
1    $21,336,567
2    $34,377,856
3    $11,679,543
4    $19,035,945
5    $27,182,718
6    $36,519,753
7    $13,368,219
8     $6,133,262
9    $15,998,572
10   $10,486,894
11    $9,767,987
12   $14,646,637
13    $6,073,396
14   $10,908,029
15    $9,982,041
16    $2,211,487
17    $4,588,054
18   $23,795,545
19    $5,297,162
20    $3,306,896
21    $2,533,631
22   $11,150,276
23    $7,810,445
24    $3,911,223
25    $2,989,791
26    $5,666,761
27   $11,536,029
28    $2,071,690
29    $2,514,987
30    $5,009,646
31    $8,953,672
32    $5,134,580
33    $2,452,179
34    $5,507,800
35    $5,571,294
36    $3,840,453
37   $11,349,831
38   $36,474,319
39    $3,616,655
40    $2,348,792
41    $3,253,886
42    $4,428,451
43    $1,888,312

In [ ]:
#atp_df.columns = ['Rank', 'Name', 'Total', 'Singles','Doubles']

In [43]:
men_df= pd.DataFrame([])

for atp_df in atp_dfs:
    atp_df.columns = ['Rank', 'Name', 'Total', 'Singles','Doubles', 'Career']
    atp_df = atp_df[['Rank','Name', 'Total', 'Singles','Doubles' ]]
    men_df = pd.concat([men_df, atp_df])

In [44]:
print(men_df.columns)

Index(['Rank', 'Name', 'Total', 'Singles', 'Doubles'], dtype='object')

In [46]:
men_df.reset_index(drop = True)

    Rank                Name        Total      Singles   Doubles
0      1     Djokovic, Novak  $10,590,175  $10,581,665    $8,510
1      2     Alcaraz, Carlos   $9,506,924   $9,506,924        $0
2      3    Medvedev, Daniil   $7,777,474   $7,777,474        $0
3      4      Sinner, Jannik   $5,092,373   $5,041,360   $51,013
4      5      Rublev, Andrey   $4,052,486   $3,714,248  $338,238
..   ...                 ...          ...          ...       ...
523  524         Kodat, Toby      $31,145      $28,984    $2,161
524  525      Winter, Edward      $30,651      $26,786    $3,865
525  526    Santillan, Akira      $30,650      $21,703    $8,947
526  527  Lazarov, Alexandar      $30,605      $30,605        $0
527  528   Vrbensky, Michael      $30,562      $23,967    $6,595

[528 rows x 5 columns]

In [ ]:
#mkdir files
#cd files
#name each file with the date 
#also store all weekly rank data in a single file, for atp and wta ("all_weeks")

In [47]:
os.mkdir("files")

In [48]:
ls

OCT9.ipynb                tennisOCT3.ipynb          weekly_race_to_top.csv
atp_live_ranking.csv      tennisgpt.ipynb           weekly_ranks.csv
files/                    tennispay.ipynb
old_atp_live_ranking.csv  tennisweekly.ipynb

In [49]:
women_df.to_csv("files/09022023_wta.csv")

In [50]:
men_df.to_csv("files/09022023_atp.csv")

In [51]:
ls

OCT9.ipynb                tennisOCT3.ipynb          weekly_race_to_top.csv
atp_live_ranking.csv      tennisgpt.ipynb           weekly_ranks.csv
files/                    tennispay.ipynb
old_atp_live_ranking.csv  tennisweekly.ipynb

In [52]:
date = date.today()

In [53]:
print(date)

2023-10-09

In [ ]:
#each time we download the new pdf, name the 
#prefix = date
#name = f"{prefix}, "wta.csv""

In [54]:
date = date.today()
men_df.to_csv(f"files/{date}_atp.csv")

In [55]:
women_df.to_csv(f"files/{date}_wta.csv")

In [ ]:
# all pseudocode 
# mixed_df.columns = men_name, men_total, women_name, women_total 
# mixed_df.columns = men_df['total'], women_df['total']

In [56]:
men_df['gender'] = 'male'
women_df['gender'] = 'female'

In [57]:
mixed_df = pd.concat([women_df, men_df])

In [59]:
print(mixed_df)

                    Name      Total    Singles  Doubles  gender Rank
0       SABALENKA, ARYNA  7,369,635  7,362,685    6,950  female  NaN
1            GAUFF, COCO  5,557,372  4,903,882  653,490  female  NaN
2           SWIATEK, IGA  5,455,686  5,455,686      NaN  female  NaN
3        RYBAKINA, ELENA  4,695,437  4,631,334   64,103  female  NaN
4   VONDROUSOVA, MARKETA  4,242,953  4,104,203  138,750  female  NaN
..                   ...        ...        ...      ...     ...  ...
39           Kodat, Toby    $31,145    $28,984   $2,161    male  524
40        Winter, Edward    $30,651    $26,786   $3,865    male  525
41      Santillan, Akira    $30,650    $21,703   $8,947    male  526
42    Lazarov, Alexandar    $30,605    $30,605       $0    male  527
43     Vrbensky, Michael    $30,562    $23,967   $6,595    male  528

[1034 rows x 6 columns]

In [61]:
mixed_df.to_csv(f"files/{date}_mixed.csv")

In [ ]:
#two problems: dropped names; dollar sign

In [63]:
men_df['Total'] = men_df['Total'].str.strip('$')

In [64]:
men_df['Singles'] = men_df['Singles'].str.strip('$')

In [65]:
men_df['Doubles'] = men_df['Doubles'].str.strip('$')

In [66]:
men_df

   Rank                Name       Total     Singles  Doubles gender
0     1     Djokovic, Novak  10,590,175  10,581,665    8,510   male
1     2     Alcaraz, Carlos   9,506,924   9,506,924        0   male
2     3    Medvedev, Daniil   7,777,474   7,777,474        0   male
3     4      Sinner, Jannik   5,092,373   5,041,360   51,013   male
4     5      Rublev, Andrey   4,052,486   3,714,248  338,238   male
..  ...                 ...         ...         ...      ...    ...
39  524         Kodat, Toby      31,145      28,984    2,161   male
40  525      Winter, Edward      30,651      26,786    3,865   male
41  526    Santillan, Akira      30,650      21,703    8,947   male
42  527  Lazarov, Alexandar      30,605      30,605        0   male
43  528   Vrbensky, Michael      30,562      23,967    6,595   male

[528 rows x 6 columns]

In [67]:
mixed_df = pd.concat([women_df, men_df])

In [69]:
print(mixed_df.iloc[55])

Name       SCHMIEDLOVA, ANNA KAROLINA
Total                         716,919
Singles                       708,213
Doubles                         8,706
gender                         female
Rank                              NaN
Name: 9, dtype: object

In [ ]:
#problems with women_df: 
# - ranks not in sequence: 
# - no names for some pages: 
# - doubles earnings missing last 3 digits:

In [70]:
women_df.reset_index(drop = True)

                               Name      Total    Singles  Doubles  gender
0                  SABALENKA, ARYNA  7,369,635  7,362,685    6,950  female
1                       GAUFF, COCO  5,557,372  4,903,882  653,490  female
2                      SWIATEK, IGA  5,455,686  5,455,686      NaN  female
3                   RYBAKINA, ELENA  4,695,437  4,631,334   64,103  female
4              VONDROUSOVA, MARKETA  4,242,953  4,104,203  138,750  female
..                              ...        ...        ...      ...     ...
501                    CE, GABRIELA     17,694     17,694      NaN  female
502                 MATOULA, MARTHA     17,679     15,220    2,459  female
503          FALCONI HARTMAN, IRINA     17,591     17,183      408  female
504  FERNANDEZ OLIVARES, LYA ISABEL     17,584     17,584      NaN  female
505                      XU, MINGGE     17,342     17,088      254  female

[506 rows x 5 columns]

In [71]:
mixed_df = pd.concat([women_df, men_df])

In [72]:
mixed_df.to_csv(f"files/{date}_mixed.csv")